Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: converts a Rune to its numeric HTML entity equivalent.
ja: ルーン文字を数値 HTML エンティティへ等価変換します。

source: cookie* {.importc: "cookie".}: uint32 ## Cookie to synchronize two events.
ja: cookie* {.importc: "cookie".}: uint32 ## イベント同士の同期用クッキー。

source: copy code into memory passed in by the caller and do all relocations (needed before using tcc_get_symbol()).
ja: 呼び出し元から渡されたメモリにあるコードをコピー後に再割り当て処理を一括で行います (必ず tcc_get_symbol() を使う前に呼び出してください)。

source: copyDir proc
ja: copyDir プロシージャ

source: copyDirWithPermissions proc
ja: copyDirWithPermissions プロシージャ

source: copyFile proc
ja: copyFile プロシージャ

source: copyFileWithPermissions proc
ja: copyFileWithPermissions プロシージャ

source: coroutines
ja: コルーチン

source: could not track child Source Edit
ja: could not track child ソース 編集

source: create a new TCC compilation context Source Edit
ja: 新しい TCC コンパイルのコンテキストを作成します ソース 編集

source: create a tags file
ja: tags ファイルを作成します

source: createDir proc
ja: createDir プロシージャ

source: createHardlink proc
ja: createHardlink プロシージャ

source: createSymlink proc
ja: createSymlink プロシージャ

source: csource command
ja: csource コマンド

source: currentSourcePath template
ja: currentSourcePath テンプレート

source: data contents changed Source Edit
ja: data contents changed ソース 編集

source: decimal up to 10 places?
ja: 十桁までの十進数？

source: decode DER/BER bytestring into X.509 certificate struct Source Edit
ja: 欠陥誤り率 (DER)・ビット誤り率 (BER) のバイト文字列を X.509 証明書の構造体へデコードします ソース 編集

source: default iterator over a collection
ja: コレクションのデフォルト・イテレータです

source: define a conditional symbol (Optionally: Define the value for that symbol, see: "compile time define pragmas")
ja: 条件付きシンボルを定義します (オプションとして: シンボルの値を定義できます。詳細は: "コンパイル時のプラグマ定義" を参照してください)

source: define preprocessor symbol 'sym'.
ja: プリプロセッサシンボル 'sym' を定義します。

source: del is supposed to be faster than delete, because it does not keep the order; delete keeps the order
ja: del には順序がないため delete よりも高速です。 delete には順序があります

source: delEnv proc
ja: delEnv プロシージャ

source: delete proc
ja: delete プロシージャ

source: deprecated pragma
ja: deprecated プラグマ

source: deprecated, prefer quit Source Edit
ja: deprecated, prefer quit ソース 編集

source: describes a database type Source Edit
ja: データベース型の概要 ソース 編集

source: describes a parsing event Source Edit
ja: describes a parsing event ソース 編集

source: description
ja: 説明

source: dfa, writetracking
ja: 決定性有限オートマトン (DFA)、ライト・トラッキング

source: different styles for text output Source Edit
ja: テキスト出力の各種スタイル ソース 編集

source: dirent_t struct Source Edit
ja: dirent_t 構造体 ソース 編集

source: disables filtering tests with the command line params Source Edit
ja: disables filtering tests with the command line params ソース 編集

source: distros module
ja: distros モジュール

source: division by zero Source Edit
ja: division by zero ソース 編集

source: doubly linked lists
ja: 双方向連結リスト

source: dump all defined conditionals and search paths see also: --dump.format:json (useful with: ` | jq`)
ja: 定義条件と検索パスをすべてダンプします 関連: --dump.format:json (` | jq` で有用です)

source: dynamic library Source Edit
ja: 動的ライブラリ ソース 編集

source: dynlib module
ja: dynlib モジュール

source: effect that denotes a database operation Source Edit
ja: データベース操作を意味するエフェクト ソース 編集

source: effect that denotes a read operation Source Edit
ja: 読み取り操作を意味するエフェクト ソース 編集

source: effect that denotes a write operation Source Edit
ja: 書き込み操作を意味するエフェクト ソース 編集

source: empty rope is represented by nil Source Edit
ja: empty rope is represented by nil ソース 編集

source: emulate Nim version X of the Nim compiler
ja: Nim バージョン X のNim コンパイラををエミュレートします

source: encapsulates a database connection Source Edit
ja: データベース接続のカプセル化 ソース 編集

source: encode cert to DER string Source Edit
ja: 欠陥誤り率 (DER) 文字列を cert へエンコードします ソース 編集

source: end of file marker Source Edit
ja: ファイル終端マーカー ソース 編集

source: enumeration of all events that may occur when parsing Source Edit
ja: 構文解析時に発生するイベントの列挙型 ソース 編集

source: enumeration that lists all errors that can occur Source Edit
ja: 発生するエラーをリスト化した列挙型 ソース 編集

source: envPairs iterator
ja: envPairs イテレータ

source: equivalent to -Lpath option Source Edit
ja: オプションの -Lパス と同じです ソース 編集

source: error pragma
ja: error プラグマ

source: error variable Source Edit
ja: エラー変数 ソース 編集

source: errorHandle proc
ja: errorHandle プロシージャ

source: errorStream proc
ja: errorStream プロシージャ

source: every other character is carried over.
ja: それ以外の文字はそのままになります。

source: example:
ja: 用例:

source: exception that is raised for encoding errors Source Edit
ja: エンコーディングエラー発生時の例外 ソース 編集

source: exception that is raised if a CGI error occurs Source Edit
ja: CGI エラー時に発生する例外です ソース 編集

source: exception that is raised if a database error occurs Source Edit
ja: データベースエラー発生時の例外 ソース 編集

source: exception that is raised when server does not conform to the implemented protocol Source Edit
ja: exception that is raised when server does not conform to the implemented protocol ソース 編集

source: execCmd proc
ja: execCmd プロシージャ

source: execCmdEx proc
ja: execCmdEx プロシージャ

source: execProcess proc
ja: execProcess プロシージャ

source: execProcesses proc
ja: execProcesses プロシージャ

source: executable file Source Edit
ja: 実行可能ファイル ソース 編集

source: executes the prepared query and iterates over the result dataset.
ja: 準備したクエリの実行後に結果をデータセットとしてイテレートします。

source: executes the prepared query and returns the whole result dataset.
ja: 準備済みクエリを実行した結果をデータセット全体として返します。

source: executes the query (typically "INSERT") and returns the generated ID for the row or -1 in case of an error.
ja: クエリを実行後 (通常は "INSERT") に行の生成 ID、あるいはエラーならば -1 返します。

source: executes the query (typically "INSERT") and returns the generated ID for the row.
ja: クエリを実行後 (通常は "INSERT") に行の生成 ID を返します。

source: executes the query (typically "UPDATE") and returns the number of affected rows.
ja: クエリを実行後 (通常は "UPDATE") に処理対象となった行数を返します。

source: executes the query and iterates over the result dataset.
ja: クエリを実行した結果をデータセットとしてイテレートします。

source: executes the query and raises EDB if not successful.
ja: クエリを実行します。失敗したときは EDB が発生します。

source: executes the query and returns the first column of the first row of the result dataset.
ja: クエリを実行した結果としてデータセットの最初の行にある最初の列を返します。

source: executes the query and returns the whole result dataset.
ja: クエリを実行した結果をデータセット全体として返します

source: existsDir proc
ja: existsDir プロシージャ

source: existsEnv proc
ja: existsEnv プロシージャ

source: existsFile proc
ja: existsFile プロシージャ

source: existsOrCreateDir proc
ja: existsOrCreateDir プロシージャ

source: expandSymlink proc
ja: expandSymlink プロシージャ

source: expandTilde proc
ja: expandTilde プロシージャ

source: expands to charset({' ', '\9'..'\13'}) Source Edit
ja: expands to charset({' ', '\9'..'\13'}) ソース 編集

source: expands to charset({'0'..'9'}) Source Edit
ja: expands to charset({'0'..'9'}) ソース 編集

source: expands to charset({'A'..'Z', 'a'..'z', '_'}) Source Edit
ja: expands to charset({'A'..'Z', 'a'..'z', '_'}) ソース 編集

source: expands to charset({'A'..'Z', 'a'..'z'}) Source Edit
ja: expands to charset({'A'..'Z', 'a'..'z'}) ソース 編集

source: expands to charset({'a'..'z', 'A'..'Z', '0'..'9', '_'}) Source Edit
ja: expands to charset({'a'..'z', 'A'..'Z', '0'..'9', '_'}) ソース 編集

source: experimental pragma
ja: experimental プラグマ

source: extract the documentation to a json file
ja: json ファイルのドキュメンテーションを抽出します

source: extractFilename proc
ja: extractFilename プロシージャ

source: f_bavail*: Fsblkcnt ## Number of free blocks available to
ja: f_bavail*: Fsblkcnt ## 非特権プロセスで利用できる

source: f_blocks*: Fsblkcnt ## Total number of blocks on file system
ja: f_blocks*: Fsblkcnt ## f_frsize 単位による

source: fatal pragma
ja: fatal プラグマ

source: fileNewer proc
ja: fileNewer エイリアス

source: fills the appropriate environment variables to test your CGI application.
ja: CGI アプリケーションのテストするために適切な環境変数を記述します。

source: final pragma
ja: final プラグマ

source: find the pattern (default)
ja: 検索パターン (デフォルト)

source: flock type Source Edit
ja: flock 型 ソース 編集

source: folding araq
ja: フォルディングは araq

source: follow across forks Source Edit
ja: follow across forks ソース 編集

source: follow real directories (default)
ja: 実ディレクトリを辿ります (デフォルト)。

source: follow symbolic links to directories
ja: ディレクトリへのシンボリックリンクを辿ります。

source: force rebuilding of all modules
ja: 強制的にモジュールをすべて再ビルドします

source: form feed
ja: フォームフィード

source: free a TCC compilation context Source Edit
ja: TCC コンパイルのコンテキストを解放します ソース 編集

source: frees the resources the converter c holds.
ja: コンバータ c が取得しているリソースを開放します。

source: garbage collector
ja: ガーベジ・コレクター

source: generate a DOT file containing the module dependency graph
ja: モジュールの依存関係図を記した DOT ファイルを作成します

source: generate a console app|GUI app|DLL|static library
ja: 生成アプリケーションの種類: コンソールアプリケーション (console)、 GUI アプリケーション (gui)、共有ライブラリ (lib)、静的ライブラリ (staticlib)

source: generate the documentation for inputfile
ja: inputfile (入力ファイル) からドキュメントを生成します

source: generated C code for the installation
ja: インストールで生成された C コード

source: generated binary files
ja: 生成されたバイナリファイル

source: generates a new OID.
ja: 新しいオブジェクト ID を作成します。

source: generates the HTML a element.
ja: HTML a 要素の生成。

source: generates the HTML abbr element.
ja: HTML abbr 要素の生成。

source: generates the HTML address element.
ja: HTML address要素の生成。

source: generates the HTML area element.
ja: HTML area 要素の生成。

source: generates the HTML article element.
ja: HTML article 要素の生成。

source: generates the HTML aside element.
ja: HTML aside 要素の生成。

source: generates the HTML audio element.
ja: HTML audio 要素の生成。

source: generates the HTML b element.
ja: HTML b 要素の生成。

source: generates the HTML base element.
ja: HTML base 要素の生成。

source: generates the HTML bdi element.
ja: HTML bdi 要素の生成。

source: generates the HTML bdo element.
ja: HTML bdo 要素の生成。

source: generates the HTML big element.
ja: HTML big 要素の生成。

source: generates the HTML blockquote element.
ja: HTML blockquote 要素の生成。

source: generates the HTML body element.
ja: HTML body 要素の生成。

source: generates the HTML br element.
ja: HTML br 要素の生成。

source: generates the HTML button element.
ja: HTML button 要素の生成。

source: generates the HTML canvas element.
ja: HTML canvas 要素の生成。

source: generates the HTML caption element.
ja: HTML caption 要素の生成。

source: generates the HTML cite element.
ja: HTML cite 要素の生成。

source: generates the HTML code element.
ja: HTML code 要素の生成。

source: generates the HTML col element.
ja: HTML col 要素の生成。

source: generates the HTML colgroup element.
ja: HTML colgroup 要素の生成。

source: generates the HTML data element.
ja: HTML data 要素の生成。

source: generates the HTML datalist element.
ja: HTML datalist 要素の生成。

source: generates the HTML dd element.
ja: HTML dd 要素の生成。

source: generates the HTML del element.
ja: HTML del 要素の生成。

source: generates the HTML dfn element.
ja: HTML dfn 要素の生成。

source: generates the HTML div element.
ja: HTML div 要素の生成。

source: generates the HTML dl element.
ja: HTML dl 要素の生成。

source: generates the HTML dt element.
ja: HTML dt 要素の生成。

source: generates the HTML em element.
ja: HTML em 要素の生成。

source: generates the HTML embed element.
ja: HTML embed 要素の生成。

source: generates the HTML fieldset element.
ja: HTML fieldset 要素の生成。

source: generates the HTML figcaption element.
ja: HTML figcaption 要素の生成。

source: generates the HTML figure element.
ja: HTML figure 要素の生成。

source: generates the HTML footer element.
ja: HTML footer 要素の生成。

source: generates the HTML form element.
ja: HTML form 要素の生成。

source: generates the HTML h1 element.
ja: HTML h1 要素の生成。

source: generates the HTML h2 element.
ja: HTML h2 要素の生成。

source: generates the HTML h3 element.
ja: HTML h3 要素の生成。

source: generates the HTML h4 element.
ja: HTML h4 要素の生成。

source: generates the HTML h5 element.
ja: HTML h5 要素の生成。

source: generates the HTML h6 element.
ja: HTML h6 要素の生成。

source: generates the HTML head element.
ja: HTML head 要素の生成。

source: generates the HTML header element.
ja: HTML header 要素の生成。

source: generates the HTML hr element.
ja: HTML hr 要素の生成。

source: generates the HTML html element.
ja: HTML html 要素の生成。

source: generates the HTML i element.
ja: HTML i 要素の生成。

source: generates the HTML iframe element.
ja: HTML iframe 要素の生成。

source: generates the HTML img element.
ja: HTML img 要素の生成。

source: generates the HTML input element.
ja: HTML input 要素の生成。

source: generates the HTML ins element.
ja: HTML ins 要素の生成。

source: generates the HTML kbd element.
ja: HTML kbd 要素の生成。

source: generates the HTML keygen element.
ja: HTML keygen 要素の生成。

source: generates the HTML label element.
ja: HTML label 要素の生成。

source: generates the HTML legend element.
ja: HTML legend 要素の生成。

source: generates the HTML li element.
ja: HTML li 要素の生成。

source: generates the HTML link element.
ja: HTML link 要素の生成。

source: generates the HTML main element.
ja: HTML main 要素の生成。

source: generates the HTML map element.
ja: HTML map 要素の生成。

source: generates the HTML mark element.
ja: HTML mark 要素の生成。

source: generates the HTML meta element.
ja: HTML meta 要素の生成。

source: generates the HTML meter element.
ja: HTML meter 要素の生成。

source: generates the HTML nav element.
ja: HTML nav 要素の生成。

source: generates the HTML noscript element.
ja: HTML noscript 要素の生成。

source: generates the HTML object element.
ja: HTML object 要素の生成。

source: generates the HTML ol element.
ja: HTML ol 要素の生成。

source: generates the HTML optgroup element.
ja: HTML optgroup 要素の生成。

source: generates the HTML option element.
ja: HTML option 要素の生成。

source: generates the HTML output element.
ja: HTML output 要素の生成。

source: generates the HTML p element.
ja: HTML p 要素の生成。

source: generates the HTML param element.
ja: HTML param 要素の生成。

source: generates the HTML pre element.
ja: HTML pre 要素の生成。

source: generates the HTML progress element.
ja: HTML progress 要素の生成。

source: generates the HTML q element.
ja: HTML q 要素の生成。

source: generates the HTML rb element.
ja: HTML rb 要素の生成。

source: generates the HTML rp element.
ja: HTML rp 要素の生成。

source: generates the HTML rt element.
ja: HTML rt 要素の生成。

source: generates the HTML rtc element.
ja: HTML rtc 要素の生成。

source: generates the HTML ruby element.
ja: HTML ruby 要素の生成。

source: generates the HTML s element.
ja: HTML s 要素の生成。

source: generates the HTML samp element.
ja: HTML samp 要素の生成。

source: generates the HTML script element.
ja: HTML script 要素の生成。

source: generates the HTML section element.
ja: HTML section 要素の生成。

source: generates the HTML select element.
ja: HTML select 要素の生成。

source: generates the HTML small element.
ja: HTML small 要素の生成。

source: generates the HTML source element.
ja: HTML source 要素の生成。

source: generates the HTML span element.
ja: HTML span 要素の生成。

source: generates the HTML strong element.
ja: HTML strong 要素の生成。

source: generates the HTML style element.
ja: HTML style 要素の生成。

source: generates the HTML sub element.
ja: HTML sub 要素の生成。

source: generates the HTML sup element.
ja: HTML sup 要素の生成。

source: generates the HTML table element.
ja: HTML table 要素の生成。

source: generates the HTML tbody element.
ja: HTML tbody 要素の生成。

source: generates the HTML td element.
ja: HTML td 要素の生成。

source: generates the HTML template element.
ja: HTML template 要素の生成。

source: generates the HTML textarea element.
ja: HTML textarea 要素の生成。

source: generates the HTML tfoot element.
ja: HTML tfoot 要素の生成。

source: generates the HTML th element.
ja: HTML th 要素の生成。

source: generates the HTML thead element.
ja: HTML thead 要素の生成。

source: generates the HTML time element.
ja: HTML time 要素の生成。

source: generates the HTML title element.
ja: HTML title 要素の生成。

source: generates the HTML tr element.
ja: HTML tr 要素の生成。

source: generates the HTML track element.
ja: track 要素の生成。

source: generates the HTML tt element.
ja: HTML tt 要素の生成。

source: generates the HTML u element.
ja: HTML u 要素の生成。

source: generates the HTML ul element.
ja: HTML ul 要素の生成。

source: generates the HTML var element.
ja: HTML var 要素の生成。

source: generates the HTML video element.
ja: HTML video 要素の生成。

source: generates the HTML wbr element.
ja: HTML wbr 要素の生成。

source: generic hash SharedTable Source Edit
ja: generic hash SharedTable ソース 編集

source: generic shared list Source Edit
ja: 汎用共有リスト ソース 編集

source: geo coords?)
ja: ジオメトリック座標？)

source: get the current column the parser has arrived at.
ja: パーサーが到達した現在の桁を取得します。

source: get the current line the parser has arrived at.
ja: パーサーが到達した現在の行を取得します。

source: get the filename of the file that the parser processes.
ja: パーサーで処理するファイルの名前を取得します。

source: get the type kind Source Edit
ja: get the type kind ソース 編集

source: getAppDir proc
ja: getAppDir プロシージャ

source: getAppFilename proc
ja: getAppFilename プロシージャ

source: getConfigDir proc
ja: getConfigDir プロシージャ

source: getCreationTime proc
ja: getCreationTime エイリアス

source: getCurrentCompilerExe proc
ja: getCurrentCompilerExe プロシージャ

source: getCurrentDir proc
ja: getCurrentDir プロシージャ

source: getEnv proc
ja: getEnv プロシージャ

source: getFileInfo(file) proc
ja: getFileInfo(file) プロシージャ

source: getFileInfo(handle) proc
ja: getFileInfo(handle) プロシージャ

source: getFileInfo(path) proc
ja: getFileInfo(path) プロシージャ

source: getHomeDir proc
ja: getHomeDir プロシージャ

source: getLastAccessTime proc
ja: getLastAccessTime エイリアス

source: getLastModificationTime proc
ja: getLastModificationTime エイリアス

source: getProjectPath proc
ja: getProjectPath プロシージャ

source: getTempDir proc
ja: getTempDir プロシージャ

source: gets the handle from the current executable.
ja: 現在の実行可能ファイルからハンドルを取得します。

source: given a library name pattern s write possible library names to dest.
ja: 指定されたライブラリ名のパターン s に一致した利用可能なライブラリ名を dest へ出力します。

source: glob_t Source Edit
ja: glob_t 構造体 ソース 編集

source: global pragma
ja: global プラグマ

source: hint pragma
ja: hint プラグマ

source: if useEnvVars is true, the SSL_CERT_FILE and SSL_CERT_DIR environment variables can be used to override the certificate directories to scan or specify a CA certificate file.
ja: useEnvVars が true ならば、環境変数 SSL_CERT_FILE と SSL_CERT_DIR で格納先ディレクトリのオーバーライド、または CA 証明書ファイルを指定できます。

source: immediate pragma
ja: immediate プラグマ

source: implements long strings represented as trees for lazy evaluation; used mainly by the code generators
ja: 遅延評価用の長大文字列表現によるツリーの実装。主にコードジェネレータで使います

source: implements the top-level command dispatching
ja: 最上位コマンド・ディスパッチングの実装

source: implies a low-level operation
ja: 低水準処理を意味します。

source: import the nimprof module
ja: nimprof モジュールをインポートします。

source: includes key in c.
ja: c に key をインクルードします。

source: inconsistent right now
ja: 現時点では一貫性はありません

source: incremental
ja: インクリメンタル

source: increments c[key] by val.
ja: val で c[key] をインクリメント (増分) します。

source: inexact result Source Edit
ja: inexact result ソース 編集

source: information about a database column Source Edit
ja: データベースのカラム (列) に関する情報 ソース 編集

source: information about a given host Source Edit
ja: information about a given host ソース 編集

source: information about a service Source Edit
ja: information about a service ソース 編集

source: initializes the parser with an input stream.
ja: 入力ストリームでパーサーを初期化します。

source: inits the BaseLexer with a stream to read from.
ja: ストリームを読み取って BaseLexer を初期化します。

source: innerText proc
ja: innerText プロシージャ

source: inputHandle proc
ja: inputHandle プロシージャ

source: inputStream proc
ja: inputStream プロシージャ

source: insert proc
ja: insert プロシージャ

source: inserts key with value val into c.
ja: c にある値 val を key へ挿入します。

source: invalid operation Source Edit
ja: invalid operation ソース 編集

source: is Posix's bind, because bind is a reserved word Source Edit
ja: POSIX の bind であり、 bind は予約語です。 ソース 編集

source: is converted to
ja: 変換先

source: is raised for a JSON error Source Edit
ja: JSON エラーの発生 ソース 編集

source: is raised for a SEXP error Source Edit
ja: SEXP エラーの発生 ソース 編集

source: it hides the number of types that the DB supports
ja: データベースでサポートする型の数値を隠せるからです

source: it's close to what many DBs offer natively (char**)
ja: ほとんどのデータベースで標準装備 (char**) されているものに近いからです

source: it's convenient when all you do is to forward the data to somewhere else (echo, log, put the data into a new query)
ja: つまり、データの外部転送時 (エコー、ログ、新規クエリへのデータ入力) に都合が良いです

source: items iterator
ja: items イテレータ

source: iterates over the list.
ja: リストをイテレートします。

source: iterator over (key, value) pairs
ja: (key, value) ペアのイテレータです

source: joinPath(head, tail) proc
ja: joinPath(head, tail) プロシージャ

source: joinPath(varargs) proc
ja: joinPath(varargs) プロシージャ

source: js codegen
ja: js コード生成

source: json module
ja: json モジュール

source: kill proc
ja: kill プロシージャ

source: kind of SQL abstract syntax tree Source Edit
ja: SQL における抽象構文木 (AST) の種類 ソース 編集

source: lambda lifting
ja: ラムダ・リフティング

source: lastPathPart proc
ja: lastPathPart プロシージャ

source: len* {.importc: "len".}: uint32 ## Length (including NULs) of name.
ja: len* {.importc: "len".}: uint32 ## name の長さ (ナル文字類も算入)。

source: line pragma
ja: line プラグマ

source: linearScanEnd pragma
ja: linearScanEnd プラグマ

source: link and run main() function and return its value.
ja: main() 関数のリンクと実行後に値を返します。

source: link count changed Source Edit
ja: link count changed ソース 編集

source: list of all supported HTML tags; order will always be alphabetically Source Edit
ja: リストに記載されている HTML タグはすべてサポートしています。また、整列順はアルファベット順です ソース 編集

source: loads a library from path.
ja: path からライブラリをロードします。

source: loads a library with name matching pattern, similar to what dlimport pragma does.
ja: dlimport プラグマと同様に、 pattern と一致する名前のライブラリをロードします。

source: loads the datafile that unidecode to work.
ja: unidecode で使う datafile をロードします。

source: locks module
ja: locks モジュール

source: low water mark Source Edit
ja: low water mark ソース 編集

source: macro of type pointer to fenv_t to be used as the argument to functions taking an argument of type fenv_t; in this case the default environment will be used Source Edit
ja: macro of type pointer to fenv_t to be used as the argument to functions taking an argument of type fenv_t; in this case the default environment will be used ソース 編集

source: main file of the C code generator
ja: C コードジェネレータのメインファイル

source: main module: parses the command line and calls main.MainCommand
ja: nimmain モジュール: コマンドラインの解析と main.MainCommand の呼び出し

source: mask for hint bits Source Edit
ja: mask for hint bits ソース 編集

source: mask for pid Source Edit
ja: mask for pid ソース 編集

source: mask* {.importc: "mask".}: uint32 ## Watch mask.
ja: mask* {.importc: "mask".}: uint32 ## 監視用マスク。

source: meaning
ja: 説明

source: memfiles module
ja: memfiles モジュール

source: message queue attribute Source Edit
ja: メッセージキューの属性 ソース 編集

source: mitems iterator
ja: mitems イテレータ

source: moveDir proc
ja: moveDir プロシージャ

source: moveFile proc
ja: moveFile プロシージャ

source: multithreading araq
ja: マルチスレッドは araq

source: name* {.importc: "name".}: char ## Name.
ja: name* {.importc: "name".}: char ## 名前。

source: newColonExpr(a, b) -> a: b Source Edit
ja: newColonExpr(a, b) -> a: b ソース 編集

source: newElement proc
ja: newElement プロシージャ

source: newXmlTree proc
ja: newXmlTree プロシージャ

source: nim command [options] [projectfile] [arguments]
ja: nim コマンド [オプション] [プロジェクトファイル] [引数]

source: nim doc --project filename.nim
ja: nim doc --project ファイル名.nim

source: nim doc <filename>.nim
ja: nim doc <ファイル名>.nim

source: nim doc2 --git.url:<url> filename.nim
ja: nim doc2 --git.url:<url> ファイル名.nim

source: nim doc2 --index:on filename.nim
ja: nim doc2 --index:on ファイル名.nim

source: nimgrep User's manual
ja: nimgrep ユーザーズ・マニュアル

source: nimgrep [options] [pattern] [replacement] (file/directory)*
ja: nimgrep [オプション] [パターン] [置換文字列] (ファイル/ディレクトリ)*

source: niminst User's manual
ja: niminst ユーザーズ・マニュアル

source: niminst is a tool to generate an installer for a Nim program.
ja: niminst は Nim プログラム用のインストーラを生成ツールです。

source: niminst uses the Nim parsecfg module to parse the configuration file.
ja: niminst はコンフィギュレーション・ファイルの解析に Nim の parsecfg モジュールを使います。
